CSI API ETABS v1
cPropFrameSDShape.GetReinfLine Method
 Retrieves property data for a line reinforcing shape in a section designer section
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetReinfLine(
	string Name,
	string ShapeName,
	ref double X1,
	ref double Y1,
	ref double X2,
	ref double Y2,
	ref double Spacing,
	ref string RebarSize,
	ref bool EndBars,
	ref string MatRebar
)
Function GetReinfLine (
	Name As String,
	ShapeName As String,
	ByRef X1 As Double,
	ByRef Y1 As Double,
	ByRef X2 As Double,
	ByRef Y2 As Double,
	ByRef Spacing As Double,
	ByRef RebarSize As String,
	ByRef EndBars As Boolean,
	ByRef MatRebar As String
) As Integer
Dim instance As cPropFrameSDShape
Dim Name As String
Dim ShapeName As String
Dim X1 As Double
Dim Y1 As Double
Dim X2 As Double
Dim Y2 As Double
Dim Spacing As Double
Dim RebarSize As String
Dim EndBars As Boolean
Dim MatRebar As String
Dim returnValue As Integer
returnValue = instance.GetReinfLine(Name,
	ShapeName, X1, Y1, X2, Y2, Spacing,
	RebarSize, EndBars, MatRebar)
int GetReinfLine(
	String^ Name,
	String^ ShapeName,
	double% X1,
	double% Y1,
	double% X2,
	double% Y2,
	double% Spacing,
	String^% RebarSize,
	bool% EndBars,
	String^% MatRebar
)
abstract GetReinfLine :
        Name : string *
        ShapeName : string *
        X1 : float byref *
        Y1 : float byref *
        X2 : float byref *
        Y2 : float byref *
        Spacing : float byref *
        RebarSize : string byref *
        EndBars : bool byref *
        MatRebar : string byref -> int
Parameters
Name
Type: System.String
 The name of an existing frame section property that is a section designer section
ShapeName
Type: System.String
 The name of a line reinforcing shape in the section designer section
X1
Type: System.Double
 The section designer X coordinate of the first drawn end point of the line reinforcing. [L]
Y1
Type: System.Double
 The section designer Y coordinate of the first drawn end point of the line reinforcing. [L]
X2
Type: System.Double
 The section designer X coordinate of the second drawn end point of the line reinforcing. [L]
Y2
Type: System.Double
 The section designer Y coordinate of the second drawn end point of the line reinforcing. [L]
Spacing
Type: System.Double
 The center-to-center spacing of the bars in the line pattern shape. [L]
RebarSize
Type: System.String
 The size of the reinforcing bars used in the line reinforcing shape
EndBars
Type: System.Boolean
 This item is True when there are bars at the end points of the line reinforcing
MatRebar
Type: System.String
 The material property for the reinforcing steel
Return Value
Type: Int32
 Returns zero if the property data is successfully retrieved; otherwise it returns a nonzero value
Remarks
See Also
Reference
cPropFrameSDShape Interface
ETABSv1 Namespace